child('Сокет Шарпов', 'Блок Шарпов').
child('Сокет Шарпов', 'Плата Шарпова').
child('Память Шарпова', 'Парсер Микромягкий').
child('Память Шарпова', 'Система Микромягкая').
child('Сервис Шарпов', 'Сокет Шарпов').
child('Сервис Шарпов', 'Память Шарпова').
child('Лог Шарпов', 'Сокет Шарпов').
child('Лог Шарпов', 'Память Шарпова').
child('Скала Шарпова', 'Слот Виртуалов').
child('Скала Шарпова', 'Строка Виртуалова').
child('Терминал Виртуалов', 'Слот Виртуалов').
child('Терминал Виртуалов', 'Строка Виртуалова').
child('Павершелл Виртуалов', 'Терминал Виртуалов').
child('Павершелл Виртуалов', 'Консоль Виртуалова').
child('Плюсоед Шарпов', 'Лог Шарпов').
child('Плюсоед Шарпов', 'Скала Шарпова').
child('Трекер Шарпов', 'Лог Шарпов').
child('Трекер Шарпов', 'Скала Шарпова').
child('База Шарпова', 'Лог Шарпов').
child('База Шарпова', 'Скала Шарпова').


male('Блок Шарпов').
male('Сокет Шарпов').
male('Парсер Микромягкий').
male('Слот Виртуалов').
male('Сервис Шарпов').
male('Лог Шарпов').
male('Терминал Виртуалов').
male('Плюсоед Шарпов').
male('Трекер Шарпов').
male('Павершелл Виртуалов').

female('Плата Шарпова').
female('Система Микромягкая').
female('Память Шарпова').
female('Строка Виртуалова').
female('Скала Шарпова').
female('Консоль Виртуалова').
female('База Шарпова').
