child('Павершелл Виртуалов', 'Консоль Виртуалова').
child('Павершелл Виртуалов', 'Терминал Виртуалов').
child('База Шарпова', 'Лог Шарпов').
child('Плюсоед Шарпов', 'Лог Шарпов').
child('Трекер Шарпов', 'Лог Шарпов').
child('Память Шарпова', 'Система Микромягкая').
child('База Шарпова', 'Скала Шарпова').
child('Плюсоед Шарпов', 'Скала Шарпова').
child('Трекер Шарпов', 'Скала Шарпова').
child('Лог Шарпов', 'Память Шарпова').
child('Сервис Шарпов', 'Память Шарпова').
child('Лог Шарпов', 'Сокет Шарпов').
child('Сервис Шарпов', 'Сокет Шарпов').
child('Сокет Шарпов', 'Плата Шарпова').
child('Скала Шарпова', 'Слот Виртуалов').
child('Терминал Виртуалов', 'Слот Виртуалов').
child('Сокет Шарпов', 'Блок Шарпов').
child('Скала Шарпова', 'Строка Виртуалова').
child('Терминал Виртуалов', 'Строка Виртуалова').
child('Память Шарпова', 'Парсер Микромягкий').


female('Консоль Виртуалова').
female('База Шарпова').
female('Система Микромягкая').
female('Скала Шарпова').
female('Память Шарпова').
female('Плата Шарпова').
female('Строка Виртуалова').


male('Сервис Шарпов').
male('Терминал Виртуалов').
male('Трекер Шарпов').
male('Лог Шарпов').
male('Сокет Шарпов').
male('Павершелл Виртуалов').
male('Слот Виртуалов').
male('Плюсоед Шарпов').
male('Блок Шарпов').
male('Парсер Микромягкий').

